src/cbs ips.xml

    1	
    2025-09-12 07:16:19.
	001ATAS252550085
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fcub="http://fcubs.ofss.com/service/FCUBSRTService">
    <soapenv:Body>
        <fcub:CREATETRANSACTION_FSFS_REQ>
            <fcub:FCUBS_HEADER>
                <fcub:SOURCE>PTP</fcub:SOURCE>
                <fcub:UBSCOMP>FCUBS</fcub:UBSCOMP>
                <fcub:USERID>PTPUSER</fcub:USERID>
                <fcub:BRANCH>001</fcub:BRANCH>
                <fcub:MODULEID>RT</fcub:MODULEID>
                <fcub:SERVICE>FCUBSRTService</fcub:SERVICE>
                <fcub:OPERATION>CreateTransaction</fcub:OPERATION>
            </fcub:FCUBS_HEADER>
            <fcub:FCUBS_BODY>
                <fcub:Transaction-Details>
                    <fcub:PRD>ATAS</fcub:PRD>
                    <fcub:BRN>001</fcub:BRN>
                    <fcub:TXNACC>0011161843313001</fcub:TXNACC>
                    <fcub:TXNCCY>ETB</fcub:TXNCCY>
                    <fcub:TXNAMT>1.0</fcub:TXNAMT>
                    <fcub:NARRATIVE>IPS</fcub:NARRATIVE>
                    <fcub:TRACKREVERSE>Y</fcub:TRACKREVERSE>
                </fcub:Transaction-Details>
            </fcub:FCUBS_BODY>
        </fcub:CREATETRANSACTION_FSFS_REQ>
    </soapenv:Body>
</soapenv:Envelope>
<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <work:WorkContext xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXekABJ3ZWJsb2dpYy5hcHAuR1dFSkIAAADWAAAAI3dlYmxvZ2ljLndvcmthcmVhLlN0cmluZ1dvcmtDb250ZXh0AAsxMi4wLjMuNS4xMAAcd2VibG9naWMuYXBwLkZDVUJTUlRTZXJ2aWNlUwAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQACzEyLjAuMy41LjEwAAA=</work:WorkContext>
    </S:Header>
    <S:Body>
        <CREATETRANSACTION_FSFS_RES xmlns="http://fcubs.ofss.com/service/FCUBSRTService">
            <FCUBS_HEADER>
                <SOURCE>FLEXCUBE</SOURCE>
                <UBSCOMP>FCUBS</UBSCOMP>
                <MSGID>9252550049208284</MSGID>
                <USERID>PTPUSER</USERID>
                <BRANCH>001</BRANCH>
                <MODULEID>RT</MODULEID>
                <SERVICE>FCUBSRTService</SERVICE>
                <OPERATION>CreateTransaction</OPERATION>
                <DESTINATION>PTP</DESTINATION>
                <MULTITRIPID>6252550129247080</MULTITRIPID>
                <FUNCTIONID>DEGRTTLR</FUNCTIONID>
                <ACTION>NEW</ACTION>
                <MSGSTAT>SUCCESS</MSGSTAT>
                <ADDL>
                    <PARAM>
                        <NAME>SERVERSTAT</NAME>
                        <VALUE>HOST</VALUE>
                    </PARAM>
                </ADDL>
            </FCUBS_HEADER>
            <FCUBS_BODY>
                <Transaction-Details>
                    <XREF>001ATAS252550085</XREF>
                    <FCCREF>001ATAS252550085</FCCREF>
                    <PRD>ATAS</PRD>
                    <BRN>001</BRN>
                    <TXNBRN>001</TXNBRN>
                    <TXNACC>0011161843313001</TXNACC>
                    <TXNCCY>ETB</TXNCCY>
                    <TXNAMT>1</TXNAMT>
                    <TXNTRN>AAS</TXNTRN>
                    <OFFSETBRN>001</OFFSETBRN>
                    <OFFSETACC>1044570</OFFSETACC>
                    <OFFSETCCY>ETB</OFFSETCCY>
                    <OFFSETAMT>1</OFFSETAMT>
                    <OFFSETTRN>AAS</OFFSETTRN>
                    <XRATE>1</XRATE>
                    <LCYAMT>1</LCYAMT>
                    <TXNDATE>2025-09-12</TXNDATE>
                    <VALDATE>2025-09-12</VALDATE>
                    <RELCUST>1618433</RELCUST>
                    <TCYCHGAMT>0</TCYCHGAMT>
                    <TCYCHGAMT1>0</TCYCHGAMT1>
                    <TCYCHGAMT2>0</TCYCHGAMT2>
                    <TCYTOTCHGAMT>0</TCYTOTCHGAMT>
                    <NARRATIVE>IPS</NARRATIVE>
                    <TRACKREVERSE>N</TRACKREVERSE>
                    <LCYXRATE>1</LCYXRATE>
                    <MAKERID>PTPUSER</MAKERID>
                    <MAKERSTAMP>2025-09-12 10:13:03 AM</MAKERSTAMP>
                    <CHECKERID>PTPUSER</CHECKERID>
                    <CHECKERSTAMP>2025-09-12 10:13:03 AM</CHECKERSTAMP>
                    <RECSTAT>A</RECSTAT>
                    <AUTHSTAT>A</AUTHSTAT>
                    <LCYCHGAMT>0</LCYCHGAMT>
                    <LCYCHGAMT1>0</LCYCHGAMT1>
                    <LCYCHGAMT2>0</LCYCHGAMT2>
                    <DRACC>TXN</DRACC>
                    <TXNDRCR>D</TXNDRCR>
                    <BOOKDATE>2025-09-12</BOOKDATE>
                    <FT>N</FT>
                    <LCYTOTCHGAMT>0</LCYTOTCHGAMT>
                    <DENMCCY1>ETB</DENMCCY1>
                    <DENMAMT1>1</DENMAMT1>
                    <DENMAMT2>1</DENMAMT2>
                    <ACCTITLE1>TESFAYE KEBEDE BIFTU</ACCTITLE1>
                    <ACCTITLE2>P2P SETTLMENT A/C</ACCTITLE2>
                    <ACTAMT>1</ACTAMT>
                    <Charge-Details>
                        <CHGCOMP>TXN_CHARGE</CHGCOMP>
                        <CHGAMT>0</CHGAMT>
                        <CHGCCY>ETB</CHGCCY>
                        <TXNCODE>CHG</TXNCODE>
                        <NETTINGIND>N</NETTINGIND>
                        <CHGGL>1044570</CHGGL>
                        <TYPE>P</TYPE>
                        <LCYCHG>0</LCYCHG>
                        <XRATE>1</XRATE>
                    </Charge-Details>
                    <Charge-Details>
                        <CHGCOMP>CHARGE_INCOME</CHGCOMP>
                        <CHGAMT>0</CHGAMT>
                        <CHGCCY>ETB</CHGCCY>
                        <TXNCODE>CHG</TXNCODE>
                        <NETTINGIND>N</NETTINGIND>
                        <CHGGL>4014290</CHGGL>
                        <TYPE>P</TYPE>
                        <LCYCHG>0</LCYCHG>
                        <XRATE>1</XRATE>
                    </Charge-Details>
                    <Charge-Details>
                        <CHGCOMP>VAT_FROM_ENAT</CHGCOMP>
                        <CHGAMT>0</CHGAMT>
                        <CHGCCY>ETB</CHGCCY>
                        <TXNCODE>VAT</TXNCODE>
                        <NETTINGIND>N</NETTINGIND>
                        <CHGGL>2061440</CHGGL>
                        <TYPE>P</TYPE>
                        <LCYCHG>0</LCYCHG>
                        <XRATE>1</XRATE>
                    </Charge-Details>
                </Transaction-Details>
                <FCUBS_WARNING_RESP>
                    <WARNING>
                        <WCODE>GW-SAV-03</WCODE>
                        <WDESC>Transaction completed Succesfully</WDESC>
                    </WARNING>
                </FCUBS_WARNING_RESP>
            </FCUBS_BODY>
        </CREATETRANSACTION_FSFS_RES>
    </S:Body>
</S:Envelope>